# Спортсмен-лыжник начал тренировки, пробежав в первый день 10 км. Каждый следующий день он увеличивал длину пробега на P процентов от пробега
# предыдущего дня (P — вещественное, 0< P <50). По данному P определить, после
# какого дня суммарный пробег лыжника за все дни превысит 200 км, и вывести
# найденное количество дней K (целое) и суммарный пробег S (вещественное число)

D1 = 10
P = input("процент прогресса=")
while type(P) !=int:
    try:
        P = int(P)
        if 0 > P or P > 50:
            print("процент должен быть не меньше 0, не больше 50")
            P = input("процент прогресса")
    except ValueError:
        print("введите корректный процент")
        P = input("процент прогресса=")
DD = 1
while D1<200:
    D1 *= P * 0.1
    print("ДЕНЬ", DD, "пробежал=", D1)
    DD += 1



