#Дано целое число N (>0). Найти наименьшее целое положительное число K, квадрат которого превосходит N: K2 > N. Функцию извлечения квадратного корня не использовать
n = input("Введите целое число N : ")
while type(n) != int:
    try:
        n = int(n)
        if n <= 0:
            print("N должно быть больше 0!")
            n = input("Введите целое число N : ")
    except ValueError:
        print("Неправильно ввели!")
        n = input("Введите целое число N : ")
k=1
while k * k <= n:
    k += 1
    print(k*k)